text/17-utilities.org
#+title: Chapter 17 : Some utilities

* <<intro>>

In previous chapters we have seen a variety of utility procedures for initialising symbol tables, for reading numbers, identifiers and special characters, for reporting errors and for other purposes.  To keep the programs short, only minimal utilities were provided.  In no two programs were the utilities sufficiently large /and/ sufficiently complex to warrant collecting them in a common library of utilities.  The payoff becomes different when the utilities are large and useful in several different programs.  In fact, one may taylor the programs to use as many portions of the utilities as possible, and to accept that some portions will not be used.  This is the approach we shall use in the remainder of this book.  In this chapter we design and implement some general utilities, in the remaining chapters we use them.

* Desirable utilities

** /A scanner/:
The core of the utilities is a scanner, a procedure which reads characters from the input file, assembles short groups of them into symbols such as numbers in decimal or other notation, quoted single characters, quoted strings of characters, identifiers, reserved words and sequences of special characters such as punctuation and other symbols.  Reserved words and sequences of special symbols should be looked up in a table; identifiers should not be looked up because the required details are likely to vary in different applications.  The scanner must also handle comments.

** /Directives/:
For many purposes it is useful to let the scanner handle directives.  These are special purpose instructions to the scanner to affect its behaviour.  They are not passed on to the parser, indeed as far as the parser is concerned they are invisible just like comments.  One important directive is the =INCLUDE= directive which tells the scanner to suspend reading from the input file and to start reading from another.  When the end of that file is reached, reading resumes from the previous file.  It should be possible to nest such inclusions.  Also useful is a =LISTING= directive which can set an internal variable so that any input is copied to a listing file and any output goes not only to the output file but is also copied to the listing file.  In special cases one might want the listing file to contain debugging information, so it is desirable to have levels of listing.  As in any programming language, a conditional =IF= directive can be useful.  The kind chosen here is the simplest, it applies only to lines in the input file.  When the =IF= part evaluates to true, the remainder of the input line is processed, otherwise it is skipped.  A collection of variables =A .. Z= can have integer values assigned to them with the =SET= directive.  For numbers in alternative notation, the radix can be set to any value between 2 and 36 inclusive.

** /Errors/:
Any error messages should in the first place go to the output file, which may be the user terminal or a disk file.  But, if a listing is being produced, error messages should also go to the listing file.  It is best if error messages actually point to where in the input line the error occurred.  So, for errors reported to the output file, the input line should be repeated and a pointer placed under the position of the error.  In the listing file the line should not be repeated if it is the first error in that line.  However, for second and later errors in the same line it is more informative if the line is repeated in the output file and the listing file.  In the listing file all lines that are copied from the input should be given line numbers, and all error reports should give the offending line together with its line number.

** /Other utilities/:
Any program that uses the scanner will have to enter reserved words into a table; it is useful to include a procedure which enters one reserved word per call (and checks for overflow).  A similar procedure is useful for user declared identifiers.  Programs that make use of the utilities should not have to bother about the listing file.  Any output should be handled by the utilities, writing to the output file and, if necessary, to the listing file.

To make the utilities flexible, some declarations have to occur before the file of utilities can be read in.  These declarations are specific to the particular use to which the utilities are being put.  Hence these declarations have to occur in the program which uses the utilities, before the utilities file is being included.  The details should be apparent in the programs in the next three chapters.

* The implementation

Many of the names or identifiers are similar to those in PLZERO of Wirth (1976) and Wirth's PASCALS decribed in Berry(1982).

** The scanner

By far the largest procedure is the scanner, procedure =getsym=.  It reads characters from the current input file and assembles them into symbols.  The reading is actually done by a local procedure =getch= which is described below.  Procedure =getsym= begins by skipping any non-printing characters and then uses a =CASE= statement to dispatch on the current character in the global variable =ch=.  Some of the cases are familiar from previous programs.  Each of the cases assigns a value to the global variable =sym= which is of the enumeration type symbol.  Some of the cases also assign an integer value to the global variable num.  These two variables constitute the principal output of the scanner.

