17-utilities.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter 17 : Some utilities</title>
<!-- 2013-05-31 Fri 19:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="michal"/>
<link rel="stylesheet" type="text/css" href="/etc/sympas/style.css">
</head>
<body>
<div id="content">
<h1 class="title">Chapter 17 : Some utilities</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. </a></li>
<li><a href="#sec-2">2. Desirable utilities</a>
<ul>
<li><a href="#sec-2-1">2.1. <i>A scanner</i>:</a></li>
<li><a href="#sec-2-2">2.2. <i>Directives</i>:</a></li>
<li><a href="#sec-2-3">2.3. <i>Errors</i>:</a></li>
<li><a href="#sec-2-4">2.4. <i>Other utilities</i>:</a></li>
</ul>
</li>
<li><a href="#sec-3">3. The implementation</a>
<ul>
<li><a href="#sec-3-1">3.1. The scanner</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. <i>Single characters</i>:</a></li>
<li><a href="#sec-3-1-2">3.1.2. <i>Character strings</i>:</a></li>
<li><a href="#sec-3-1-3">3.1.3. <i>Parentheses and comments</i>:</a></li>
<li><a href="#sec-3-1-4">3.1.4. <i>Signed numbers and hyphens</i>:</a></li>
<li><a href="#sec-3-1-5">3.1.5. <i>Numbers in alternative radix</i>:</a></li>
<li><a href="#sec-3-1-6">3.1.6. <i>Identifiers</i>:</a></li>
<li><a href="#sec-3-1-7">3.1.7. <i>Directives</i>:</a></li>
<li><a href="#sec-3-1-8">3.1.8. <i>Other cases</i>:</a></li>
<li><a href="#sec-3-1-9">3.1.9. <i>Procedure getch</i>:</a></li>
<li><a href="#sec-3-1-10">3.1.10. <i>Function value</i>:</a></li>
<li><a href="#sec-3-1-11">3.1.11. <i>Procedure directive</i>:</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. Error reporting</a></li>
<li><a href="#sec-3-3">3.3. Other Utilities</a></li>
<li><a href="#sec-3-4">3.4. <i>Initialisation</i>:</a></li>
<li><a href="#sec-3-5">3.5. <i>Parsing</i>:</a></li>
<li><a href="#sec-3-6">3.6. <i>Output</i>:</a></li>
</ul>
</li>
<li><a href="#sec-4">4. The program</a></li>
<li><a href="#sec-5">5. Remarks and a major project</a></li>
<li><a href="#sec-6">6. <i>A Major Project</i>:</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a id="intro" name="intro"></a></h2>
<div class="outline-text-2" id="text-1">
<p>
In previous chapters we have seen a variety of utility procedures for initialising symbol tables, for reading numbers, identifiers and special characters, for reporting errors and for other purposes.  To keep the programs short, only minimal utilities were provided.  In no two programs were the utilities sufficiently large <i>and</i> sufficiently complex to warrant collecting them in a common library of utilities.  The payoff becomes different when the utilities are large and useful in several different programs.  In fact, one may taylor the programs to use as many portions of the utilities as possible, and to accept that some portions will not be used.  This is the approach we shall use in the remainder of this book.  In this chapter we design and implement some general utilities, in the remaining chapters we use them.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Desirable utilities</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <i>A scanner</i>:</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The core of the utilities is a scanner, a procedure which reads characters from the input file, assembles short groups of them into symbols such as numbers in decimal or other notation, quoted single characters, quoted strings of characters, identifiers, reserved words and sequences of special characters such as punctuation and other symbols.  Reserved words and sequences of special symbols should be looked up in a table; identifiers should not be looked up because the required details are likely to vary in different applications.  The scanner must also handle comments.
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <i>Directives</i>:</h3>
<div class="outline-text-3" id="text-2-2">
<p>
For many purposes it is useful to let the scanner handle directives.  These are special purpose instructions to the scanner to affect its behaviour.  They are not passed on to the parser, indeed as far as the parser is concerned they are invisible just like comments.  One important directive is the <code>INCLUDE</code> directive which tells the scanner to suspend reading from the input file and to start reading from another.  When the end of that file is reached, reading resumes from the previous file.  It should be possible to nest such inclusions.  Also useful is a <code>LISTING</code> directive which can set an internal variable so that any input is copied to a listing file and any output goes not only to the output file but is also copied to the listing file.  In special cases one might want the listing file to contain debugging information, so it is desirable to have levels of listing.  As in any programming language, a conditional <code>IF</code> directive can be useful.  The kind chosen here is the simplest, it applies only to lines in the input file.  When the <code>IF</code> part evaluates to true, the remainder of the input line is processed, otherwise it is skipped.  A collection of variables <code>A .. Z</code> can have integer values assigned to them with the <code>SET</code> directive.  For numbers in alternative notation, the radix can be set to any value between 2 and 36 inclusive.
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> <i>Errors</i>:</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Any error messages should in the first place go to the output file, which may be the user terminal or a disk file.  But, if a listing is being produced, error messages should also go to the listing file.  It is best if error messages actually point to where in the input line the error occurred.  So, for errors reported to the output file, the input line should be repeated and a pointer placed under the position of the error.  In the listing file the line should not be repeated if it is the first error in that line.  However, for second and later errors in the same line it is more informative if the line is repeated in the output file and the listing file.  In the listing file all lines that are copied from the input should be given line numbers, and all error reports should give the offending line together with its line number.
</p>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> <i>Other utilities</i>:</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Any program that uses the scanner will have to enter reserved words into a table; it is useful to include a procedure which enters one reserved word per call (and checks for overflow).  A similar procedure is useful for user declared identifiers.  Programs that make use of the utilities should not have to bother about the listing file.  Any output should be handled by the utilities, writing to the output file and, if necessary, to the listing file.
</p>

<p>
To make the utilities flexible, some declarations have to occur before the file of utilities can be read in.  These declarations are specific to the particular use to which the utilities are being put.  Hence these declarations have to occur in the program which uses the utilities, before the utilities file is being included.  The details should be apparent in the programs in the next three chapters.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The implementation</h2>
<div class="outline-text-2" id="text-3">
<p>
Many of the names or identifiers are similar to those in PLZERO of Wirth (1976) and Wirth's PASCALS decribed in Berry(1982).
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> The scanner</h3>
<div class="outline-text-3" id="text-3-1">
<p>
By far the largest procedure is the scanner, procedure <code>getsym</code>.  It reads characters from the current input file and assembles them into symbols.  The reading is actually done by a local procedure <code>getch</code> which is described below.  Procedure <code>getsym</code> begins by skipping any non-printing characters and then uses a <code>CASE</code> statement to dispatch on the current character in the global variable <code>ch</code>.  Some of the cases are familiar from previous programs.  Each of the cases assigns a value to the global variable <code>sym</code> which is of the enumeration type symbol.  Some of the cases also assign an integer value to the global variable num.  These two variables constitute the principal output of the scanner.
</p>
</div>
