text/17-utilities.org
*** /Single characters/:
If =ch= is a single quote character, then this signals a character constant.  Following the quote is normally an ordinary character, and then the global variable =num= is set to the ordinal value of that character.  However, if the character following is the backslash =\=, then the ordinal value returned in variable =num= is given by a numeric scan-time expression.  In most cases this will be a literal number, for example ='\65= is equivalent to ='A=.  However, following the backslash can be an expression computed at scan-time by a local function =value= described below.

*** /Character strings/:
If =ch= is a double quote character, then what is being read is a string constant.  While the next character is not the terminating double quote character, further characters are read and stored in a large array of characters which is made to hold all strings that are read.  The start position of the current string is recorded in a further integer array of starting positions, and the next value in this array gives the starting position of the next string that will be read.  The index in this integer array is assigned to the global variable num.  Hence the length and content of the currently read string can be determined by using the value of =num= and =num+1= as indices into the integer array.  The values recorded there can then be used to retrieve the string from the large character array.  This part of the scanner is not being used in the three programs in this book which use the utilities, but it has been used elsewhere.

*** /Parentheses and comments/:
These are handled as in previous programs: =(*= signals a comment and causes skipping up to the closing =*)= and a =GOTO= the beginning of the scanner.  A left parenthesis character without a following asterisk is just a parenthesis symbol.

*** /Signed numbers and hyphens/:
If =ch= is a decimal digit character or a hyphen =-=, then the symbol is either just the hyphen symbol in case it is not followed by digits, or it is a negative number in case it is followed by digits, or it is a positive number in case there is no preceding =-=.  So, if there is no leading =-=, then the number being read is not to be negated, and a Boolean flag is set to that effect.  Otherwise the flag is set to eventually negate the number being read, if indeed there is one.  If there are no digits immediately after the =-=, then the symbol is just a hyphen, and a =GOTO= the end of the scanner is effected.  Otherwise a string of decimal digits is read as normal, and the number is possibly negated.

*** /Numbers in alternative radix/:
For some purposes it is useful to be able to read numbers in other than decimal notation but in a different radix.  Such numerals are signalled by a leading =&=.  The default alternative radix is 2, but it can be set by a directive =%RADIX N=, where N is a scan-time expression whose value is between 2 and 36 inclusive.  Digits beyond =9= are taken to be =A= .. =Z=; so hexadecimal uses =A= .. =F=.  Reading successive digits is very similar to reading decimal notation, instead of multiplying values by 10 they have to be multiplied by the alternative radix.  A minor complication arises because in ASCII the character sequence =0= ..=9= is not immediately followed by =A= .. =Z=, there is a gap which has to be taken care of.  If a digit exceeds the maximum allowed for the current radix, then an error has to be signalled.

*** /Identifiers/:
If =ch= is a lowercase letter, the symbol being read is an identifier.  The letter and any further lowercase letters, digits and underscores are collected into a short variable of type ident which are strings whose length is determined by a =CONST= defined in the program which includes the utilities.  No lookup is performed.

*** /Directives/:
If =ch= is a =%=, then procedure =directive= is called, see below.

*** /Other cases/:
If =ch= is anything else, a catch-all case is entered.  If =ch= is an uppercase letter, then it and any further letters, digits and underscores are collected into a string.  If =ch= is any other special character, then it together with any further special characters that are likely to occur as further characters in combinations such as =:==, =<== or =..= are collected into a string.  The string starting with an uppercase letter or a special character is then used to search a table of reserved words.  If it is found there, then the variable =sym= is set to what is recorded in the table, otherwise it is treated just like an identifier starting with a lowercase letter.  The various directives have been implemented as a cascade of =IF-THEN-ELSE-IF..= statements in Pascal.  It would have been possible and more efficient to use a binary search through a table of directives.  However, directives do not occur often, hence their efficiency is a minor issue.  The method used here is just a little simpler to implement.

This completes the cases of the body of the scanner.  There are three routines local to the scanner: a procedure for obtaining the next character, a function for computing values of scan-time expressions, and a procedure for executing directives.

