17-utilities.html
<div id="outline-container-sec-3-1-9" class="outline-4">
<h4 id="sec-3-1-9"><span class="section-number-4">3.1.9</span> <i>Procedure getch</i>:</h4>
<div class="outline-text-4" id="text-3-1-9">
<p>
The scanner <code>getsym</code> does not read the input file directly but obtains the next character from a procedure which deposits a new character in a global variable <code>ch</code>.  Because error messages to the output file should point to the position in the current input line, it is necessary to retain all of the current input line in a global string buffer.  Two global integer variables are made to point into this buffer, one records the total length, the other the current position.  Procedure <code>getch</code> starts by examining whether the buffer is empty.  This will be true if the current position is equal to the total length.  If it is, a new line will have to be read into the buffer.  But first an adjustment might have to be made to the current line number in case the immediately preceding directive was an <code>INCLUDE</code> directive, or in case the preceding line was the last line in an included file.  In the first case the line number is set to zero.  In the second case it has to be set back to what it was in the file containing the <code>INCLUDE</code> directive which originally caused the inclusion.  Because inclusions can be nested, a small global stack is used for names of included files, the last line number in the file, and, most importantly, the file variable itself.  Only after this adjustment can the line number be incremented, and buffer length and position be set to zero.  The line buffer is then filled from the current input file, but the details vary depending on whether this is the initial input file or an included file.  If the stack of included files is empty, the reading occurs from the initial input file.  If the end of file has been reached, an error is signalled.  Otherwise characters are read into the line buffer until the end of line is encountered.  On the other hand, if the stack of included files is not empty, then reading occurs from the current included file.  No error is reported if the end of that file is reached.  But if after the line has been read the end of file is reached, then the included file is closed and the adjustment flag is set to pop the stack of included files when the next line is read.  This concludes the steps that have to be taken when <code>getch</code> finds the line buffer empty.  At any rate, the line buffer will not be empty now.  The current position is incremented, and <code>ch</code> is assigned the character value from the buffer at the current position.
</p>
</div>
</div>
<div id="outline-container-sec-3-1-10" class="outline-4">
<h4 id="sec-3-1-10"><span class="section-number-4">3.1.10</span> <i>Function value</i>:</h4>
<div class="outline-text-4" id="text-3-1-10">
<p>
This function computes integer values of scan-time expressions written in prefix notation.  It is called by the scanner when handling the backslash <code>\</code> in character constants and string constants, and by the procedure which handles directives.  The function calls <code>getch</code> until <code>ch</code> is a printing character.  If it is a character that can start a number or a single character, then it calls <code>getsym</code> recursively and returns whatever <code>getsym</code> deposits in the global variable num.  If the character is an uppercase letter, then it returns the value retrieved from an array of integer values that would have been assigned there by a previous <code>SET</code> directive.  Parentheses can be used for readability, but are not necessary for prefix notation.  The special characters <code>+</code>, <code>-</code>, <code>*</code> and <code>/</code> have their obvious meaning as binary arithmetic operators, they result in two recursive calls to the function and then a computation of the value.  The characters <code>=</code>, <code>&gt;</code> and <code>&lt;</code> are interpreted as relational operators returning 1 or 0 for true and false.  Finally, <code>?</code> causes a number to be read from the input file.  Any other character produces an error.
</p>
</div>
</div>
<div id="outline-container-sec-3-1-11" class="outline-4">
<h4 id="sec-3-1-11"><span class="section-number-4">3.1.11</span> <i>Procedure directive</i>:</h4>
<div class="outline-text-4" id="text-3-1-11">
<p>
This procedure is called from one case in the scanner when it sees the character <code>%</code>; since the procedure is only called there its body might have been incorporated there.  The procedure reads letters into a string and then examines the string.  For the IF directive the function <code>value</code> is called, if that returns a value less than 1, the remainder of the current input line is to be skipped.  This is done by setting the position variable of the line buffer to the length of the line buffer &#x2014; this will cause procedure <code>getch</code> to read from a new line.  For the <code>SET</code> directive the expected syntax is <code>%SET V = value</code>, where <code>V</code> is an uppercase letter.  Errors occur when <code>V</code> is not an uppercase letter or when <code>=</code> is missing.  Function <code>value</code> is called to assign an integer to the array of scan-time variables at position <code>V</code>.  For the PUT directive the remainder of the input line is copied from the line buffer to the output file &#x2014; this is useful only if the input comes from a disk file.  The other three directives, <code>LISTING</code>, <code>STATISTICS</code> and <code>RADIX</code> simply set global variables to an integer returned by the function <code>value</code>.
</p>

<p>
This completes the scanning procedure <code>getsym</code>
</p>
</div>
</div>
</div>
