17-utilities.html
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Error reporting</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The procedure for reporting errors takes two value parameters: a single character and a string.  The single character serves to indicate the kind of error, the string is the actual error message.  The procedure has to write the position in the input line where the error occurred, and then, on a separate line, an error mark that is defined as a (short) string constant in the program which uses the utilities, then the character indicating the kind of error, and then the error message.  All this has to be written to the output file, and, if a listing is being written, to the listing file.
</p>

<p>
Several complications arise.  Firstly, the line which contains the error can be in an included file.  In that case it is not informative if the line number given is simply the ordinal number of the line that has been processed.  Instead it is better if the error report states the name of the file and the line number in terms of that file.  Secondly, in the listing file it is not necessary to repeat an input line if the current error is the first error in that line.  So the scanning procedure <code>getsym</code> and the error reporting procedure have to cooperate in a number of ways.  It is necessary to keep track of line numbers and names of included files.  This is done by the small explicit global stack already mentioned in the description of procedure <code>getch</code>.
</p>

<p>
The body of the error reporting procedure increments the global error count in all cases except when the character parameter is an <code>I</code>, indicating a merely informational message.  Programs using the utilities can access the error count for reporting, and they can set it back to zero.  Then the procedure handles any writing to the output file, and any writing to the listing file.  For the output file, if the error occurs in an include file, this is indicated by a remark and the name of the include file.  Then the procedure calls a local procedure <code>point_to_symbol</code> to do the actual error reporting to the output file.  If a listing is being produced, that same local procedure is called again, this time to report to the listing file.
</p>

<p>
The local procedure takes a file variable as formal parameter.  It does all its writing to that file.  A second Boolean value parameter indicates whether the current input line is to be repeated.  If it is, then the current line number, the separator between line numbers and text, and then the line buffer are written as one line to the parameter file.  In any case, for the next line it writes firstly a mark under the previous line number, secondly sufficient spaces to reach the error position in the input line, and thirdly the pointer <code>^</code>.  On the following line it writes the error mark, the character indicating the kind of error, and the actual error message.
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Other Utilities</h3>
<div class="outline-text-3" id="text-3-3">
<p>
All the other utilities are relatively minor.
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> <i>Initialisation</i>:</h3>
<div class="outline-text-3" id="text-3-4">
<p>
There is one procedure to initialise all the global variables used by the utilities; most of them are integers that have to be set to zero.  A program which uses the utilities would normally begin by calling this initialisation procedure.  Such a program might then re-assign some of these variables, for example the default alternative radix or the set of special characters that can occur in second or later positions in reserved words such as <code>&lt;=</code> and <code>::=</code>.  There are two procedures for entering reserved words and standard identifiers into tables.  The sizes of these tables are given by constants in the program that uses the utilities, and the two procedures will check for overflow and produce appropriate error messages.  A program which uses the utilities would call the entering procedures once for each reserved word or identifier that is to be entered.  The scanner will know about the last reserved word that has been entered, and it will perform the lookup correctly even if the table is not filled completely.  No lookup is performed for standard identifiers and no such procedure is provided; this is because the method that is required is likely to vary widely between applications.
</p>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> <i>Parsing</i>:</h3>
<div class="outline-text-3" id="text-3-5">
<p>
To facilitate parsing there are two procedures.  One checks whether the last symbol returned by the scanner is identical with one of its parameters, otherwise an error is reported using a string parameter as the message.  The other tests whether the last symbol is a member of one of its parameters, a set of symbols.  If it is not, then an error is reported and symbols are skipped until the symbol is in the first set or in another set that is a further parameter.
</p>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> <i>Output</i>:</h3>
<div class="outline-text-3" id="text-3-6">
<p>
There are three principal output procedures.  One is for writing signed integers, internally it uses a recursive procedure to convert an integer into a sequence of digit characters.  The other two write strings of the size of reserved words and standard identifiers; since these may have different lengths, separate procedures are used.  All three first check whether the item to be written really fits onto the line, and if it does not fit, then a subsidiary procedure for ending a line is called first.  This procedure will do a writeln to the output file, and, if a listing is being written, to the listing file.  It also sets a variable to keep track of the length of the output line.  The three principal procedures output characters by calling another subsidiary procedure for writing a single character.  This writes the character to the output file.  If a listing is being produced, it also writes the character to the listing file; but if a new line had just been started it first writes to the listing file as many spaces as there are in a line number and the separator between the line number and the following text.  It also increments the counter which keeps track of the length of the output line &#x2014; except that if the character to be written is the newline character, <code>chr(13)</code>, it sets the counter to zero.  One last output utility, used for finalising a run, writes to the output file and potentially to the listing file the CPU time in milliseconds taken by this run.
</p>
</div>
</div>
</div>
