text/17-utilities.org
* The program

The following is the standard Pascal source program for the utilities.

#+begin_src pascal
(* File: Included file for scan utilities *)
VAR listing : text;

CONST

maxincludelevel = 5;
maxlinelength = 132;
linenumwidth = 4; linenumspace = '    ';
linenumsep = '    ';
underliner = '****    ';
tab_in_listing = '    ----    ';
maxoutlinelength = 60;
messagelength = 30;

initial_alternative_radix = 2;

maxchartab = 1000;
maxstringtab = 100;
maxnodtab = 1000;

TYPE

identalfa = PACKED ARRAY [1..identlength] OF char;
resalfa = PACKED ARRAY [1..reslength] OF char;
message = PACKED ARRAY [1 .. messagelength] OF char;
toops = RECORD symbols,types,strings,chars : integer END;
symset = SET OF symbol;

VAR

inputs : ARRAY [1..maxincludelevel] OF
    RECORD fil : text; nam : identalfa; lastlinenumber : integer END;
includelevel,adjustment : integer;
writelisting : integer;
must_repeat_line : boolean;

scantimevariables : ARRAY ['A'..'Z'] OF integer;
alternative_radix : integer;
linenumber : integer;
line : ARRAY [1..maxlinelength] OF char;
cc,ll : integer;
ch : char;
ident : identalfa;
id : standardident;
res : resalfa;
specials_repeat : SET OF char;
sym : symbol;
num : integer;
reswords : ARRAY [1..maxrestab] OF
    RECORD alf : resalfa; symb : symbol END;
lastresword : integer;
stdidents : ARRAY [1..maxstdidenttab] OF
    RECORD alf : identalfa; symb : standardident END;
laststdident : integer;
resword_inverse : ARRAY [symbol] OF 0..maxrestab;
trace : integer;
stringtab : ARRAY [1..maxstringtab] OF integer;
chartab : PACKED ARRAY [1..maxchartab] OF char;

toop : toops;

errorcount : integer;
outlinelength : integer;
statistics : integer;
start_clock : integer;

(* - - - - -   MODULE ERROR    - - - - - *)

PROCEDURE point(diag : char; mes : message);

    PROCEDURE point_to_symbol(repeatline : boolean; VAR f : text);
    VAR i : integer; c : char;
    BEGIN (* point_to_symbol *)
    IF repeatline THEN
        BEGIN
        write(f,linenumber:linenumwidth,linenumsep);
        FOR i := 1 TO ll DO write(f,line[i]); writeln(f);
        END;
    write(f,underliner);
    FOR i := 1 TO cc - 2 DO
        BEGIN
        c := line[i];
        IF c < ' '  THEN write(f,c) ELSE write(f,' ')
        END;
    writeln(f,'^ ');
    writeln(f,errormark,'-',diag,'  ',mes);
    IF diag = 'F' THEN writeln(f,'execution aborted')
    END; (* point_to_symbol *)

BEGIN (* point *)
IF diag <> 'I' THEN errorcount := errorcount + 1;
IF includelevel > 0 THEN
    writeln(output,'INCLUDE file : "',inputs[includelevel].nam,'"');
point_to_symbol(true,output);
IF writelisting > 0 THEN
    BEGIN
    point_to_symbol(must_repeat_line,listing);
    must_repeat_line := true
    END;
IF diag = 'F' THEN GOTO 99
END; (* point *)

(* - - - - -   MODULE SCANNER    - - - - - *)

PROCEDURE iniscanner;
VAR c : char;
BEGIN (* iniscanner *)
start_clock := clock;
open(listing,list_filename,NEW);
rewrite(listing);
writelisting := 0;
ch := ' '; linenumber := 0;
cc := 1; ll := 1; (* to enable fatal message during initialisation *)
specials_repeat := []; (* default: no repeats *)
includelevel := 0; adjustment := 0;
alternative_radix := initial_alternative_radix;
lastresword := 0;
laststdident := 0;
outlinelength := 0;
FOR c := 'A' TO 'Z' DO scantimevariables[c] := 0;
errorcount := 0;
must_repeat_line := false;
END; (* iniscanner *)

PROCEDURE erw(a : resalfa; s : symbol);
BEGIN (* erw *)
lastresword := lastresword + 1;
IF lastresword > maxrestab THEN
    point('F','too many reserved words       ');
WITH reswords[lastresword] DO
        BEGIN alf := a; symb := s END;
resword_inverse[s] := lastresword
END; (* erw *)

PROCEDURE est(a : identalfa; s : standardident);
BEGIN (* est *)
laststdident := laststdident + 1;
IF laststdident > maxstdidenttab THEN
    point('F','too many identifiers          ');
WITH stdidents[laststdident] DO
        BEGIN alf := a; symb := s END
END; (* est *)

PROCEDURE newfile(a : identalfa);
BEGIN (* newfile *)
WITH inputs[includelevel + 1] DO
        BEGIN
        nam := a;
        lastlinenumber := linenumber;
(* PYRAMID-UNIX:
                reset(fil,a)
     VAX-VMS:
                open(fil,a,OLD);
                reset(fil)
*)
                open(fil,a,OLD);
                reset(fil)
                END;
adjustment := 1;
END; (* newfile *)

PROCEDURE endfile;
BEGIN cc := ll; adjustment := -1 END;

PROCEDURE getsym;
LABEL 1,9;
VAR i,j,k : integer; c0 : char; negated : boolean;

    PROCEDURE perhapslisting;
    VAR i : integer;
    BEGIN
    IF writelisting > 0 THEN
        BEGIN
        write(listing,linenumber:linenumwidth,linenumsep);
        FOR i := 1 TO ll DO write(listing,line[i]);
        writeln(listing);
        must_repeat_line := false
        END
    END;

    PROCEDURE getch;
    BEGIN (* getch *)
    IF cc = ll THEN
        BEGIN
        IF adjustment <> 0 THEN
            BEGIN
            IF adjustment = -1
                THEN linenumber := inputs[includelevel].lastlinenumber
                ELSE linenumber := 0;
            includelevel := includelevel + adjustment; adjustment := 0
            END;
        linenumber := linenumber + 1;
        ll := 0; cc := 0;
        IF includelevel = 0 THEN
            BEGIN
            IF eof(input) THEN
                point('F','unexpected end of file        ');
            WHILE NOT eoln(input) DO
                BEGIN
                ll := ll + 1;
                read(input,ch);
                line[ll] := ch
                end;
            perhapslisting;
            ll := ll + 1; read(input,line[ll])
            END
        ELSE
            WITH inputs[includelevel] DO
                BEGIN
                WHILE NOT eoln(fil) DO
                    BEGIN
                    ll := ll + 1;
                    read(fil,ch);
                    line[ll] := ch
                    END;
                perhapslisting;
                ll := ll + 1; read(fil,line[ll]);
                IF eof(fil) THEN
                    BEGIN close(fil); adjustment := -1 END;
                END (* WITH *)
        END; (* IF *)
    cc := cc + 1; ch := line[cc]
    END; (* getch *)

    FUNCTION value : integer;
    (* this is a  LL(0)  parser *)
    VAR k,v : integer;
    BEGIN (* value *)
    REPEAT getch UNTIL ch > ' ';
    IF ch IN ['&','0'..'9',''''] THEN
        BEGIN getsym; value := num END
    ELSE IF ch IN ['A'..'Z'] THEN
        value := scantimevariables[ch]
    ELSE IF ch = '(' THEN
        BEGIN
        value := value;
        WHILE ch <= ' ' DO getch;
        IF ch = ')' THEN getch ELSE
            point('E','right parenthesis expected    ');
        END
    ELSE CASE ch OF
        '+' : value := value + value;
        '-' : value := value - value;
        '*' : value := value * value;
        '/' : value := value DIV value;
        '=' : value := ord(value = value);
        '>' : value := ord(value > value);
        '<' : value := ord(value < value);
        '?' : BEGIN read(v); value := v END
        OTHERWISE
            point('F','illegal start of scan expr    ')
        END (* CASE *)
    END; (* value *)

    PROCEDURE directive;
    CONST
        emptydir = '                '; dirlength = 16;
    VAR
        c : char; i : integer;
        dir : PACKED ARRAY [1 .. dirlength] OF char;
    BEGIN (* directive *)
    getch; i := 0; dir := emptydir;
    REPEAT
        IF i < dirlength THEN
            BEGIN i := i + 1; dir[i] := ch END;
        getch
        UNTIL NOT (ch IN ['A'..'Z','_']);
    IF dir = 'IF            ' THEN
            BEGIN IF value < 1 THEN cc := ll (* readln *) END
    ELSE IF dir = 'INCLUDE         ' THEN
            BEGIN
            IF includelevel = maxincludelevel THEN
                point('F','too many include files        ');
            WHILE ch <= ' '  DO getch;
            k := 0; ident := emptyident;
            REPEAT
                IF k < identlength THEN
                    BEGIN k := k + 1; ident[k] := ch END;
                getch;
                UNTIL ch <= ' ';
            newfile(ident)
            END
    ELSE IF dir = 'PUT             ' THEN
            BEGIN
            FOR i := cc TO ll DO write(line[i]);
            cc := ll; writeln
            END
    ELSE IF dir = 'SET             ' THEN
            BEGIN
            WHILE ch <= ' '  DO getch;
            IF NOT (ch IN ['A'..'Z']) THEN
                point('E','"A" .. "Z" expected           ');
            c := ch; getch;
            WHILE ch <= ' '  DO getch;
            IF ch <> '=' THEN
                point('E','"=" expected                  ');
            scantimevariables[c] := value;
            END
    ELSE IF dir = 'TRACE           ' THEN
            trace := value
    ELSE IF dir = 'LISTING         ' THEN
            BEGIN
            i := writelisting;
            writelisting := value;
            IF i = 0 THEN perhapslisting
            END
    ELSE IF dir = 'STATISTICS      ' THEN
            statistics := value
    ELSE IF dir = 'RADIX           ' THEN
            alternative_radix := value
    ELSE point('F','unknown directive             ');
    getch;
    GOTO 1
    END; (* directive *)

BEGIN (* getsym *)
1 :
WHILE ch <= ' '  DO getch;
CASE ch OF
    '''' :
        BEGIN
        getch;
        IF ch = '\' THEN num := value ELSE
            BEGIN num := ord(ch); getch END;
        IF ch = '''' THEN getch;
        sym := charconst
        END;
    '"' :
        BEGIN
        WITH toop DO
            BEGIN
            IF strings = maxstringtab THEN
                point('F','too many strings              ');
            strings := strings + 1;
            stringtab[strings] := chars + 1;
            num := strings
            END;
        getch;
        WHILE ch <> '"' DO
            BEGIN
            IF ch = '\' THEN c0 := chr(value) ELSE
                 BEGIN c0 := ch; getch END;
            WITH toop DO
                BEGIN
                chars := chars + 1;
                IF chars > maxchartab THEN
                    point('F','too many characters in strings');
                chartab[chars] := c0
                END;
            END; (* WHILE *)
        getch; stringtab[num+1] := toop.chars; sym := stringconst
        (* FOR i := stringtab[num] TO stringtab[num+1] DO
            write(chartab[i]) *)
        END;
    '(' :
        BEGIN
        getch;
        IF ch <> '*' THEN sym := leftparenthesis  ELSE
            BEGIN
            getch;
            REPEAT
                WHILE ch <> '*' DO getch;
                getch
                UNTIL ch = ')';
            getch; GOTO 1
            END
        END;
    '-','0','1','2','3','4','5','6','7','8','9' :
        BEGIN
        IF ch <> '-' THEN negated := false ELSE
            BEGIN
            getch;
            IF ch IN ['0'..'9'] THEN negated := true ELSE
                BEGIN sym := hyphen;  GOTO 9 END
            END;
        sym := numberconst; num := 0;
        REPEAT
            num := 10 * num + (ord(ch) - ord('0'));
            getch;
            UNTIL NOT (ch IN ['0'..'9']);
        IF negated THEN num := - num
        END;
    '&' : (* number in alternative radix *)
        BEGIN
        sym := numberconst; num := 0;
        getch;
        WHILE ch IN ['0'..'9','A'..'Z'] DO
            BEGIN
            IF ch IN ['A'..'Z'] THEN
                ch := chr(ord(ch) + ord(succ('9')) - ord('A'));
            IF ord(ch) >= ord('0') + alternative_radix THEN
                 point('E','exceeding alternative radix   ');
            num := alternative_radix * num + (ord(ch) - ord('0'));
            getch
            END
        END;
    'a','b','c','d','e','f','g','h','i',
    'j','k','l','m','n','o','p','q','r',
    's','t','u','v','w','x','y','z' :
        BEGIN
        sym := identifier; k := 0; ident := emptyident;
        REPEAT
            IF k < identlength THEN
                BEGIN k := k + 1; ident[k] := ch END;
            getch;
            UNTIL NOT (ch IN ['a'..'z','A'..'Z','_','0'..'9'])
        END;
    '%' :
        directive;
    OTHERWISE
        BEGIN
        k := 1; res := emptyres; ident := emptyident;
        IF ch IN ['A'..'Z'] THEN
            REPEAT
                IF k <= reslength THEN res[k] := ch;
                IF k <= identlength THEN ident[k] := ch;
                getch; k := k + 1
                UNTIL NOT (ch IN ['A'..'Z','a'..'z','0'..'9','_'])
        ELSE
            REPEAT
                IF k <= reslength THEN res[k] := ch;
                IF k <= identlength THEN ident[k] := ch;
                getch; k := k + 1
                UNTIL NOT (ch IN specials_repeat);
        i := 1; j := lastresword;
        REPEAT
            k := (i + j) div 2;
            IF res <= reswords[k].alf THEN j := k -1;
            IF res >= reswords[k].alf THEN i := k + 1;
            UNTIL i > j;
        IF i - 1 > j
            THEN sym := reswords[k].symb
            ELSE sym := identifier;
        END (* OTHERWISE *)
    END; (*  CASE *)
9:
END; (* getsym *)

PROCEDURE check(sy : symbol; ss : symset; er : message);
BEGIN (* check *)
IF sym = sy THEN getsym ELSE
    BEGIN point('E',er); IF sym IN ss THEN getsym END
END; (* check *)

PROCEDURE test(s1,s2 : symset; er : message);
BEGIN (* test *)
IF NOT (sym IN s1) THEN
    BEGIN
    point('E',er);
    s1 := s1 + s2;
    IF NOT (sym IN s1) THEN
        BEGIN
        REPEAT getsym UNTIL sym IN s1;
        point('I','skipped symbols to here       ');
        END
    END
END; (* test *)

(* - - - - -   MODULE OUTPUT   - - - - - *)

PROCEDURE putch(c : char);
BEGIN
write(output,c);
IF writelisting > 0 THEN
    BEGIN
    IF outlinelength = 0 THEN
        write(listing,linenumspace,linenumsep);
    write(listing,c)
    END;
IF ord(c) = 13 (* newline character *)
    THEN outlinelength := 0
    ELSE outlinelength := outlinelength + 1
END;

PROCEDURE writeline;
BEGIN
writeln(output);
IF writelisting > 0 THEN writeln(listing);
outlinelength := 0
END;

PROCEDURE writeident(a : identalfa);
VAR i,length : integer;
BEGIN
length := identlength;
WHILE a[length] <= ' ' DO length := length - 1;
IF outlinelength + length  > maxoutlinelength THEN writeline;
FOR i := 1 TO length DO putch(a[i])
END;

PROCEDURE writeresword(a : resalfa);
VAR i,length : integer;
BEGIN
length := reslength;
WHILE a[length] <= ' ' DO length := length - 1;
IF outlinelength + length > maxoutlinelength THEN writeline;
FOR i := 1 TO length DO putch(a[i])
END;

PROCEDURE writeinteger(i : integer);

    PROCEDURE writenatural(n : integer);
    BEGIN
    IF n >= 10 THEN writenatural(n DIV 10);
    putch(chr(ord('0') + n MOD 10))
    END;

BEGIN (* writeinteger *)
IF outlinelength + 12 > maxoutlinelength THEN writeline;
IF i >= 0 THEN writenatural(i) ELSE
    BEGIN putch('-'); writenatural(-i) END
END; (* writeinteger *)

PROCEDURE finalise;

    PROCEDURE fin(VAR f : text);
    BEGIN
    IF errorcount > 0 THEN writeln(f,errorcount:0,' error(s)');
    writeln(f,clock - start_clock:0,
        ' milliseconds CPU')
    END;

BEGIN (* finalise *)
fin(output);
IF writelisting > 0 THEN fin(listing)
END; (* finalise *)
#+end_src

