17-utilities.html
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> The program</h2>
<div class="outline-text-2" id="text-4">
<p>
The following is the standard Pascal source program for the utilities.
</p>

<div class="org-src-container">

<pre class="src src-pascal"><span style="color: #66f;">(* </span><span style="color: #66f;">File: Included file for scan utilities *)</span>
<span style="color: #ff00ff;">VAR</span> listing : text;

<span style="color: #ff00ff;">CONST</span>

maxincludelevel = 5;
maxlinelength = 132;
linenumwidth = 4; linenumspace = <span style="color: #00ff00;">'    '</span>;
linenumsep = <span style="color: #00ff00;">'    '</span>;
underliner = <span style="color: #00ff00;">'****    '</span>;
tab_in_listing = <span style="color: #00ff00;">'    ----    '</span>;
maxoutlinelength = 60;
messagelength = 30;

initial_alternative_radix = 2;

maxchartab = 1000;
maxstringtab = 100;
maxnodtab = 1000;

<span style="color: #ff00ff;">TYPE</span>

identalfa = <span style="color: #ff00ff;">PACKED</span> <span style="color: #ff00ff;">ARRAY</span> [1..identlength] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">char</span>;
resalfa = <span style="color: #ff00ff;">PACKED</span> <span style="color: #ff00ff;">ARRAY</span> [1..reslength] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">char</span>;
<span style="color: #00ffff;">message</span> = <span style="color: #ff00ff;">PACKED</span> <span style="color: #ff00ff;">ARRAY</span> [1 .. messagelength] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">char</span>;
toops = <span style="color: #ff00ff;">RECORD</span> symbols,types,strings,chars : <span style="color: #ff00ff;">integer</span> <span style="color: #00ffff;">END</span>;
symset = <span style="color: #ff00ff;">SET</span> <span style="color: #00ffff;">OF</span> symbol;

<span style="color: #ff00ff;">VAR</span>

inputs : <span style="color: #ff00ff;">ARRAY</span> [1..maxincludelevel] <span style="color: #00ffff;">OF</span>
    <span style="color: #ff00ff;">RECORD</span> fil : text; nam : identalfa; lastlinenumber : <span style="color: #ff00ff;">integer</span> <span style="color: #00ffff;">END</span>;
includelevel,adjustment : <span style="color: #ff00ff;">integer</span>;
writelisting : <span style="color: #ff00ff;">integer</span>;
must_repeat_line : <span style="color: #ff00ff;">boolean</span>;

scantimevariables : <span style="color: #ff00ff;">ARRAY</span> [<span style="color: #00ff00;">'A'</span>..<span style="color: #00ff00;">'Z'</span>] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">integer</span>;
alternative_radix : <span style="color: #ff00ff;">integer</span>;
linenumber : <span style="color: #ff00ff;">integer</span>;
line : <span style="color: #ff00ff;">ARRAY</span> [1..maxlinelength] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">char</span>;
cc,ll : <span style="color: #ff00ff;">integer</span>;
ch : <span style="color: #ff00ff;">char</span>;
ident : identalfa;
id : standardident;
res : resalfa;
specials_repeat : <span style="color: #ff00ff;">SET</span> <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">char</span>;
sym : symbol;
num : <span style="color: #ff00ff;">integer</span>;
reswords : <span style="color: #ff00ff;">ARRAY</span> [1..maxrestab] <span style="color: #00ffff;">OF</span>
    <span style="color: #ff00ff;">RECORD</span> alf : resalfa; symb : symbol <span style="color: #00ffff;">END</span>;
lastresword : <span style="color: #ff00ff;">integer</span>;
stdidents : <span style="color: #ff00ff;">ARRAY</span> [1..maxstdidenttab] <span style="color: #00ffff;">OF</span>
    <span style="color: #ff00ff;">RECORD</span> alf : identalfa; symb : standardident <span style="color: #00ffff;">END</span>;
laststdident : <span style="color: #ff00ff;">integer</span>;
resword_inverse : <span style="color: #ff00ff;">ARRAY</span> [symbol] <span style="color: #00ffff;">OF</span> 0..maxrestab;
trace : <span style="color: #ff00ff;">integer</span>;
stringtab : <span style="color: #ff00ff;">ARRAY</span> [1..maxstringtab] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">integer</span>;
chartab : <span style="color: #ff00ff;">PACKED</span> <span style="color: #ff00ff;">ARRAY</span> [1..maxchartab] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">char</span>;

toop : toops;

errorcount : <span style="color: #ff00ff;">integer</span>;
outlinelength : <span style="color: #ff00ff;">integer</span>;
statistics : <span style="color: #ff00ff;">integer</span>;
start_clock : <span style="color: #ff00ff;">integer</span>;

<span style="color: #66f;">(* </span><span style="color: #66f;">- - - - -   MODULE ERROR    - - - - - *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">point</span>(diag : <span style="color: #ff00ff;">char</span>; mes : <span style="color: #00ffff;">message</span>);

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">point_to_symbol</span>(repeatline : <span style="color: #ff00ff;">boolean</span>; <span style="color: #ff00ff;">VAR</span> f : text);
    <span style="color: #ff00ff;">VAR</span> i : <span style="color: #ff00ff;">integer</span>; c : <span style="color: #ff00ff;">char</span>;
    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">point_to_symbol *)</span>
    <span style="color: #00ffff;">IF</span> repeatline <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">write</span>(f,linenumber:linenumwidth,linenumsep);
        <span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> ll <span style="color: #00ffff;">DO</span> <span style="color: #00ffff;">write</span>(f,line[i]); writeln(f);
        <span style="color: #00ffff;">END</span>;
    <span style="color: #00ffff;">write</span>(f,underliner);
    <span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> cc - 2 <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">BEGIN</span>
        c := line[i];
        <span style="color: #00ffff;">IF</span> c &lt; <span style="color: #00ff00;">' '</span>  <span style="color: #00ffff;">THEN</span> <span style="color: #00ffff;">write</span>(f,c) <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">write</span>(f,<span style="color: #00ff00;">' '</span>)
        <span style="color: #00ffff;">END</span>;
    writeln(f,<span style="color: #00ff00;">'^ '</span>);
    writeln(f,errormark,<span style="color: #00ff00;">'-'</span>,diag,<span style="color: #00ff00;">'  '</span>,mes);
    <span style="color: #00ffff;">IF</span> diag = <span style="color: #00ff00;">'F'</span> <span style="color: #00ffff;">THEN</span> writeln(f,<span style="color: #00ff00;">'execution aborted'</span>)
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">point_to_symbol *)</span>

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">point *)</span>
<span style="color: #00ffff;">IF</span> diag &lt;&gt; <span style="color: #00ff00;">'I'</span> <span style="color: #00ffff;">THEN</span> errorcount := errorcount + 1;
<span style="color: #00ffff;">IF</span> includelevel &gt; 0 <span style="color: #00ffff;">THEN</span>
    writeln(output,<span style="color: #00ff00;">'INCLUDE file : "'</span>,inputs[includelevel].nam,<span style="color: #00ff00;">'"'</span>);
point_to_symbol(true,output);
<span style="color: #00ffff;">IF</span> writelisting &gt; 0 <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">BEGIN</span>
    point_to_symbol(must_repeat_line,listing);
    must_repeat_line := true
    <span style="color: #00ffff;">END</span>;
<span style="color: #00ffff;">IF</span> diag = <span style="color: #00ff00;">'F'</span> <span style="color: #00ffff;">THEN</span> <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">99</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">point *)</span>

<span style="color: #66f;">(* </span><span style="color: #66f;">- - - - -   MODULE SCANNER    - - - - - *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">iniscanner</span>;
<span style="color: #ff00ff;">VAR</span> c : <span style="color: #ff00ff;">char</span>;
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">iniscanner *)</span>
start_clock := clock;
open(listing,list_filename,NEW);
rewrite(listing);
writelisting := 0;
ch := <span style="color: #00ff00;">' '</span>; linenumber := 0;
cc := 1; ll := 1; <span style="color: #66f;">(* </span><span style="color: #66f;">to enable fatal message during initialisation *)</span>
specials_repeat := []; <span style="color: #66f;">(* </span><span style="color: #66f;">default: no repeats *)</span>
includelevel := 0; adjustment := 0;
alternative_radix := initial_alternative_radix;
lastresword := 0;
laststdident := 0;
outlinelength := 0;
<span style="color: #00ffff;">FOR</span> c := <span style="color: #00ff00;">'A'</span> <span style="color: #00ffff;">TO</span> <span style="color: #00ff00;">'Z'</span> <span style="color: #00ffff;">DO</span> scantimevariables[c] := 0;
errorcount := 0;
must_repeat_line := false;
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">iniscanner *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">erw</span>(a : resalfa; s : symbol);
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">erw *)</span>
lastresword := lastresword + 1;
<span style="color: #00ffff;">IF</span> lastresword &gt; maxrestab <span style="color: #00ffff;">THEN</span>
    point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'too many reserved words       '</span>);
<span style="color: #00ffff;">WITH</span> reswords[lastresword] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">BEGIN</span> alf := a; symb := s <span style="color: #00ffff;">END</span>;
resword_inverse[s] := lastresword
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">erw *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">est</span>(a : identalfa; s : standardident);
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">est *)</span>
laststdident := laststdident + 1;
<span style="color: #00ffff;">IF</span> laststdident &gt; maxstdidenttab <span style="color: #00ffff;">THEN</span>
    point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'too many identifiers          '</span>);
<span style="color: #00ffff;">WITH</span> stdidents[laststdident] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">BEGIN</span> alf := a; symb := s <span style="color: #00ffff;">END</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">est *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">newfile</span>(a : identalfa);
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">newfile *)</span>
<span style="color: #00ffff;">WITH</span> inputs[includelevel + 1] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">BEGIN</span>
        nam := a;
        lastlinenumber := linenumber;
<span style="color: #66f;">(* </span><span style="color: #66f;">PYRAMID-UNIX:</span>
<span style="color: #66f;">                reset(fil,a)</span>
<span style="color: #66f;">     VAX-VMS:</span>
<span style="color: #66f;">                open(fil,a,OLD);</span>
<span style="color: #66f;">                reset(fil)</span>
<span style="color: #66f;">*)</span>
                open(fil,a,OLD);
                reset(fil)
                <span style="color: #00ffff;">END</span>;
adjustment := 1;
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">newfile *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">endfile</span>;
<span style="color: #00ffff;">BEGIN</span> cc := ll; adjustment := -1 <span style="color: #00ffff;">END</span>;

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">getsym</span>;
LABEL 1,9;
<span style="color: #ff00ff;">VAR</span> i,j,k : <span style="color: #ff00ff;">integer</span>; c0 : <span style="color: #ff00ff;">char</span>; negated : <span style="color: #ff00ff;">boolean</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">perhapslisting</span>;
    <span style="color: #ff00ff;">VAR</span> i : <span style="color: #ff00ff;">integer</span>;
    <span style="color: #00ffff;">BEGIN</span>
    <span style="color: #00ffff;">IF</span> writelisting &gt; 0 <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">write</span>(listing,linenumber:linenumwidth,linenumsep);
        <span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> ll <span style="color: #00ffff;">DO</span> <span style="color: #00ffff;">write</span>(listing,line[i]);
        writeln(listing);
        must_repeat_line := false
        <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">getch</span>;
    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">getch *)</span>
    <span style="color: #00ffff;">IF</span> cc = ll <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">IF</span> adjustment &lt;&gt; 0 <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span>
            <span style="color: #00ffff;">IF</span> adjustment = -1
                <span style="color: #00ffff;">THEN</span> linenumber := inputs[includelevel].lastlinenumber
                <span style="color: #00ffff;">ELSE</span> linenumber := 0;
            includelevel := includelevel + adjustment; adjustment := 0
            <span style="color: #00ffff;">END</span>;
        linenumber := linenumber + 1;
        ll := 0; cc := 0;
        <span style="color: #00ffff;">IF</span> includelevel = 0 <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span>
            <span style="color: #00ffff;">IF</span> eof(input) <span style="color: #00ffff;">THEN</span>
                point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'unexpected end of file        '</span>);
            <span style="color: #00ffff;">WHILE</span> <span style="color: #00ffff;">NOT</span> eoln(input) <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span>
                ll := ll + 1;
                <span style="color: #00ffff;">read</span>(input,ch);
                line[ll] := ch
                <span style="color: #00ffff;">end</span>;
            perhapslisting;
            ll := ll + 1; <span style="color: #00ffff;">read</span>(input,line[ll])
            <span style="color: #00ffff;">END</span>
        <span style="color: #00ffff;">ELSE</span>
            <span style="color: #00ffff;">WITH</span> inputs[includelevel] <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span>
                <span style="color: #00ffff;">WHILE</span> <span style="color: #00ffff;">NOT</span> eoln(fil) <span style="color: #00ffff;">DO</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    ll := ll + 1;
                    <span style="color: #00ffff;">read</span>(fil,ch);
                    line[ll] := ch
                    <span style="color: #00ffff;">END</span>;
                perhapslisting;
                ll := ll + 1; <span style="color: #00ffff;">read</span>(fil,line[ll]);
                <span style="color: #00ffff;">IF</span> eof(fil) <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span> close(fil); adjustment := -1 <span style="color: #00ffff;">END</span>;
                <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">WITH *)</span>
        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">IF *)</span>
    cc := cc + 1; ch := line[cc]
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">getch *)</span>

    <span style="color: #00ffff;">FUNCTION</span> <span style="color: #ffffff; font-weight: bold;">value</span> : <span style="color: #ff00ff;">integer</span>;
    <span style="color: #66f;">(* </span><span style="color: #66f;">this is a  LL(0)  parser *)</span>
    <span style="color: #ff00ff;">VAR</span> k,v : <span style="color: #ff00ff;">integer</span>;
    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">value *)</span>
    <span style="color: #00ffff;">REPEAT</span> getch <span style="color: #00ffff;">UNTIL</span> ch &gt; <span style="color: #00ff00;">' '</span>;
    <span style="color: #00ffff;">IF</span> ch <span style="color: #00ffff;">IN</span> [<span style="color: #00ff00;">'&amp;'</span>,<span style="color: #00ff00;">'0'</span>..<span style="color: #00ff00;">'9'</span>,<span style="color: #00ff00;">''''</span>] <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span> getsym; value := num <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">IF</span> ch <span style="color: #00ffff;">IN</span> [<span style="color: #00ff00;">'A'</span>..<span style="color: #00ff00;">'Z'</span>] <span style="color: #00ffff;">THEN</span>
        value := scantimevariables[ch]
    <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">IF</span> ch = <span style="color: #00ff00;">'('</span> <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span>
        value := value;
        <span style="color: #00ffff;">WHILE</span> ch &lt;= <span style="color: #00ff00;">' '</span> <span style="color: #00ffff;">DO</span> getch;
        <span style="color: #00ffff;">IF</span> ch = <span style="color: #00ff00;">')'</span> <span style="color: #00ffff;">THEN</span> getch <span style="color: #00ffff;">ELSE</span>
            point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'right parenthesis expected    '</span>);
        <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">CASE</span> ch <span style="color: #00ffff;">OF</span>
        <span style="color: #00ff00;">'+'</span> : value := value + value;
        <span style="color: #00ff00;">'-'</span> : value := value - value;
        <span style="color: #00ff00;">'*'</span> : value := value * value;
        <span style="color: #00ff00;">'/'</span> : value := value <span style="color: #00ffff;">DIV</span> value;
        <span style="color: #00ff00;">'='</span> : value := ord(value = value);
        <span style="color: #00ff00;">'&gt;'</span> : value := ord(value &gt; value);
        <span style="color: #00ff00;">'&lt;'</span> : value := ord(value &lt; value);
        <span style="color: #00ff00;">'?'</span> : <span style="color: #00ffff;">BEGIN</span> <span style="color: #00ffff;">read</span>(v); value := v <span style="color: #00ffff;">END</span>
        OTHERWISE
            point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'illegal start of scan expr    '</span>)
        <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">value *)</span>

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">directive</span>;
    <span style="color: #ff00ff;">CONST</span>
        emptydir = <span style="color: #00ff00;">'                '</span>; dirlength = 16;
    <span style="color: #ff00ff;">VAR</span>
        c : <span style="color: #ff00ff;">char</span>; i : <span style="color: #ff00ff;">integer</span>;
        dir : <span style="color: #ff00ff;">PACKED</span> <span style="color: #ff00ff;">ARRAY</span> [1 .. dirlength] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">char</span>;
    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">directive *)</span>
    getch; i := 0; dir := emptydir;
    <span style="color: #00ffff;">REPEAT</span>
        <span style="color: #00ffff;">IF</span> i &lt; dirlength <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span> i := i + 1; dir[i] := ch <span style="color: #00ffff;">END</span>;
        getch
        <span style="color: #00ffff;">UNTIL</span> <span style="color: #00ffff;">NOT</span> (ch <span style="color: #00ffff;">IN</span> [<span style="color: #00ff00;">'A'</span>..<span style="color: #00ff00;">'Z'</span>,<span style="color: #00ff00;">'_'</span>]);
    <span style="color: #00ffff;">IF</span> dir = <span style="color: #00ff00;">'IF            '</span> <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span> <span style="color: #00ffff;">IF</span> value &lt; 1 <span style="color: #00ffff;">THEN</span> cc := ll <span style="color: #66f;">(* </span><span style="color: #66f;">readln *)</span> <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">IF</span> dir = <span style="color: #00ff00;">'INCLUDE         '</span> <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span>
            <span style="color: #00ffff;">IF</span> includelevel = maxincludelevel <span style="color: #00ffff;">THEN</span>
                point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'too many include files        '</span>);
            <span style="color: #00ffff;">WHILE</span> ch &lt;= <span style="color: #00ff00;">' '</span>  <span style="color: #00ffff;">DO</span> getch;
            k := 0; ident := emptyident;
            <span style="color: #00ffff;">REPEAT</span>
                <span style="color: #00ffff;">IF</span> k &lt; identlength <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span> k := k + 1; ident[k] := ch <span style="color: #00ffff;">END</span>;
                getch;
                <span style="color: #00ffff;">UNTIL</span> ch &lt;= <span style="color: #00ff00;">' '</span>;
            newfile(ident)
            <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">IF</span> dir = <span style="color: #00ff00;">'PUT             '</span> <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span>
            <span style="color: #00ffff;">FOR</span> i := cc <span style="color: #00ffff;">TO</span> ll <span style="color: #00ffff;">DO</span> <span style="color: #00ffff;">write</span>(line[i]);
            cc := ll; writeln
            <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">IF</span> dir = <span style="color: #00ff00;">'SET             '</span> <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span>
            <span style="color: #00ffff;">WHILE</span> ch &lt;= <span style="color: #00ff00;">' '</span>  <span style="color: #00ffff;">DO</span> getch;
            <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span> (ch <span style="color: #00ffff;">IN</span> [<span style="color: #00ff00;">'A'</span>..<span style="color: #00ff00;">'Z'</span>]) <span style="color: #00ffff;">THEN</span>
                point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'"A" .. "Z" expected           '</span>);
            c := ch; getch;
            <span style="color: #00ffff;">WHILE</span> ch &lt;= <span style="color: #00ff00;">' '</span>  <span style="color: #00ffff;">DO</span> getch;
            <span style="color: #00ffff;">IF</span> ch &lt;&gt; <span style="color: #00ff00;">'='</span> <span style="color: #00ffff;">THEN</span>
                point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'"=" expected                  '</span>);
            scantimevariables[c] := value;
            <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">IF</span> dir = <span style="color: #00ff00;">'TRACE           '</span> <span style="color: #00ffff;">THEN</span>
            trace := value
    <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">IF</span> dir = <span style="color: #00ff00;">'LISTING         '</span> <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span>
            i := writelisting;
            writelisting := value;
            <span style="color: #00ffff;">IF</span> i = 0 <span style="color: #00ffff;">THEN</span> perhapslisting
            <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">IF</span> dir = <span style="color: #00ff00;">'STATISTICS      '</span> <span style="color: #00ffff;">THEN</span>
            statistics := value
    <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">IF</span> dir = <span style="color: #00ff00;">'RADIX           '</span> <span style="color: #00ffff;">THEN</span>
            alternative_radix := value
    <span style="color: #00ffff;">ELSE</span> point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'unknown directive             '</span>);
    getch;
    <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">1</span>
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">directive *)</span>

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">getsym *)</span>
1 :
<span style="color: #00ffff;">WHILE</span> ch &lt;= <span style="color: #00ff00;">' '</span>  <span style="color: #00ffff;">DO</span> getch;
<span style="color: #00ffff;">CASE</span> ch <span style="color: #00ffff;">OF</span>
    <span style="color: #00ff00;">''''</span> :
        <span style="color: #00ffff;">BEGIN</span>
        getch;
        <span style="color: #00ffff;">IF</span> ch = <span style="color: #00ff00;">'\'</span> <span style="color: #00ffff;">THEN</span> num := value <span style="color: #00ffff;">ELSE</span>
            <span style="color: #00ffff;">BEGIN</span> num := ord(ch); getch <span style="color: #00ffff;">END</span>;
        <span style="color: #00ffff;">IF</span> ch = <span style="color: #00ff00;">''''</span> <span style="color: #00ffff;">THEN</span> getch;
        sym := charconst
        <span style="color: #00ffff;">END</span>;
    <span style="color: #00ff00;">'"'</span> :
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">WITH</span> toop <span style="color: #00ffff;">DO</span>
            <span style="color: #00ffff;">BEGIN</span>
            <span style="color: #00ffff;">IF</span> strings = maxstringtab <span style="color: #00ffff;">THEN</span>
                point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'too many strings              '</span>);
            strings := strings + 1;
            stringtab[strings] := chars + 1;
            num := strings
            <span style="color: #00ffff;">END</span>;
        getch;
        <span style="color: #00ffff;">WHILE</span> ch &lt;&gt; <span style="color: #00ff00;">'"'</span> <span style="color: #00ffff;">DO</span>
            <span style="color: #00ffff;">BEGIN</span>
            <span style="color: #00ffff;">IF</span> ch = <span style="color: #00ff00;">'\'</span> <span style="color: #00ffff;">THEN</span> c0 := chr(value) <span style="color: #00ffff;">ELSE</span>
                 <span style="color: #00ffff;">BEGIN</span> c0 := ch; getch <span style="color: #00ffff;">END</span>;
            <span style="color: #00ffff;">WITH</span> toop <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span>
                chars := chars + 1;
                <span style="color: #00ffff;">IF</span> chars &gt; maxchartab <span style="color: #00ffff;">THEN</span>
                    point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'too many characters in strings'</span>);
                chartab[chars] := c0
                <span style="color: #00ffff;">END</span>;
            <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">WHILE *)</span>
        getch; stringtab[num+1] := toop.chars; sym := stringconst
        <span style="color: #66f;">(* </span><span style="color: #66f;">FOR i := stringtab[num] TO stringtab[num+1] DO</span>
<span style="color: #66f;">            write(chartab[i]) *)</span>
        <span style="color: #00ffff;">END</span>;
    <span style="color: #00ff00;">'('</span> :
        <span style="color: #00ffff;">BEGIN</span>
        getch;
        <span style="color: #00ffff;">IF</span> ch &lt;&gt; <span style="color: #00ff00;">'*'</span> <span style="color: #00ffff;">THEN</span> sym := leftparenthesis  <span style="color: #00ffff;">ELSE</span>
            <span style="color: #00ffff;">BEGIN</span>
            getch;
            <span style="color: #00ffff;">REPEAT</span>
                <span style="color: #00ffff;">WHILE</span> ch &lt;&gt; <span style="color: #00ff00;">'*'</span> <span style="color: #00ffff;">DO</span> getch;
                getch
                <span style="color: #00ffff;">UNTIL</span> ch = <span style="color: #00ff00;">')'</span>;
            getch; <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">1</span>
            <span style="color: #00ffff;">END</span>
        <span style="color: #00ffff;">END</span>;
    <span style="color: #00ff00;">'-'</span>,<span style="color: #00ff00;">'0'</span>,<span style="color: #00ff00;">'1'</span>,<span style="color: #00ff00;">'2'</span>,<span style="color: #00ff00;">'3'</span>,<span style="color: #00ff00;">'4'</span>,<span style="color: #00ff00;">'5'</span>,<span style="color: #00ff00;">'6'</span>,<span style="color: #00ff00;">'7'</span>,<span style="color: #00ff00;">'8'</span>,<span style="color: #00ff00;">'9'</span> :
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">IF</span> ch &lt;&gt; <span style="color: #00ff00;">'-'</span> <span style="color: #00ffff;">THEN</span> negated := false <span style="color: #00ffff;">ELSE</span>
            <span style="color: #00ffff;">BEGIN</span>
            getch;
            <span style="color: #00ffff;">IF</span> ch <span style="color: #00ffff;">IN</span> [<span style="color: #00ff00;">'0'</span>..<span style="color: #00ff00;">'9'</span>] <span style="color: #00ffff;">THEN</span> negated := true <span style="color: #00ffff;">ELSE</span>
                <span style="color: #00ffff;">BEGIN</span> sym := hyphen;  <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">9</span> <span style="color: #00ffff;">END</span>
            <span style="color: #00ffff;">END</span>;
        sym := numberconst; num := 0;
        <span style="color: #00ffff;">REPEAT</span>
            num := 10 * num + (ord(ch) - ord(<span style="color: #00ff00;">'0'</span>));
            getch;
            <span style="color: #00ffff;">UNTIL</span> <span style="color: #00ffff;">NOT</span> (ch <span style="color: #00ffff;">IN</span> [<span style="color: #00ff00;">'0'</span>..<span style="color: #00ff00;">'9'</span>]);
        <span style="color: #00ffff;">IF</span> negated <span style="color: #00ffff;">THEN</span> num := - num
        <span style="color: #00ffff;">END</span>;
    <span style="color: #00ff00;">'&amp;'</span> : <span style="color: #66f;">(* </span><span style="color: #66f;">number in alternative radix *)</span>
        <span style="color: #00ffff;">BEGIN</span>
        sym := numberconst; num := 0;
        getch;
        <span style="color: #00ffff;">WHILE</span> ch <span style="color: #00ffff;">IN</span> [<span style="color: #00ff00;">'0'</span>..<span style="color: #00ff00;">'9'</span>,<span style="color: #00ff00;">'A'</span>..<span style="color: #00ff00;">'Z'</span>] <span style="color: #00ffff;">DO</span>
            <span style="color: #00ffff;">BEGIN</span>
            <span style="color: #00ffff;">IF</span> ch <span style="color: #00ffff;">IN</span> [<span style="color: #00ff00;">'A'</span>..<span style="color: #00ff00;">'Z'</span>] <span style="color: #00ffff;">THEN</span>
                ch := chr(ord(ch) + ord(succ(<span style="color: #00ff00;">'9'</span>)) - ord(<span style="color: #00ff00;">'A'</span>));
            <span style="color: #00ffff;">IF</span> ord(ch) &gt;= ord(<span style="color: #00ff00;">'0'</span>) + alternative_radix <span style="color: #00ffff;">THEN</span>
                 point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'exceeding alternative radix   '</span>);
            num := alternative_radix * num + (ord(ch) - ord(<span style="color: #00ff00;">'0'</span>));
            getch
            <span style="color: #00ffff;">END</span>
        <span style="color: #00ffff;">END</span>;
    <span style="color: #00ff00;">'a'</span>,<span style="color: #00ff00;">'b'</span>,<span style="color: #00ff00;">'c'</span>,<span style="color: #00ff00;">'d'</span>,<span style="color: #00ff00;">'e'</span>,<span style="color: #00ff00;">'f'</span>,<span style="color: #00ff00;">'g'</span>,<span style="color: #00ff00;">'h'</span>,<span style="color: #00ff00;">'i'</span>,
    <span style="color: #00ff00;">'j'</span>,<span style="color: #00ff00;">'k'</span>,<span style="color: #00ff00;">'l'</span>,<span style="color: #00ff00;">'m'</span>,<span style="color: #00ff00;">'n'</span>,<span style="color: #00ff00;">'o'</span>,<span style="color: #00ff00;">'p'</span>,<span style="color: #00ff00;">'q'</span>,<span style="color: #00ff00;">'r'</span>,
    <span style="color: #00ff00;">'s'</span>,<span style="color: #00ff00;">'t'</span>,<span style="color: #00ff00;">'u'</span>,<span style="color: #00ff00;">'v'</span>,<span style="color: #00ff00;">'w'</span>,<span style="color: #00ff00;">'x'</span>,<span style="color: #00ff00;">'y'</span>,<span style="color: #00ff00;">'z'</span> :
        <span style="color: #00ffff;">BEGIN</span>
        sym := identifier; k := 0; ident := emptyident;
        <span style="color: #00ffff;">REPEAT</span>
            <span style="color: #00ffff;">IF</span> k &lt; identlength <span style="color: #00ffff;">THEN</span>
                <span style="color: #00ffff;">BEGIN</span> k := k + 1; ident[k] := ch <span style="color: #00ffff;">END</span>;
            getch;
            <span style="color: #00ffff;">UNTIL</span> <span style="color: #00ffff;">NOT</span> (ch <span style="color: #00ffff;">IN</span> [<span style="color: #00ff00;">'a'</span>..<span style="color: #00ff00;">'z'</span>,<span style="color: #00ff00;">'A'</span>..<span style="color: #00ff00;">'Z'</span>,<span style="color: #00ff00;">'_'</span>,<span style="color: #00ff00;">'0'</span>..<span style="color: #00ff00;">'9'</span>])
        <span style="color: #00ffff;">END</span>;
    <span style="color: #00ff00;">'%'</span> :
        directive;
    OTHERWISE
        <span style="color: #00ffff;">BEGIN</span>
        k := 1; res := emptyres; ident := emptyident;
        <span style="color: #00ffff;">IF</span> ch <span style="color: #00ffff;">IN</span> [<span style="color: #00ff00;">'A'</span>..<span style="color: #00ff00;">'Z'</span>] <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">REPEAT</span>
                <span style="color: #00ffff;">IF</span> k &lt;= reslength <span style="color: #00ffff;">THEN</span> res[k] := ch;
                <span style="color: #00ffff;">IF</span> k &lt;= identlength <span style="color: #00ffff;">THEN</span> ident[k] := ch;
                getch; k := k + 1
                <span style="color: #00ffff;">UNTIL</span> <span style="color: #00ffff;">NOT</span> (ch <span style="color: #00ffff;">IN</span> [<span style="color: #00ff00;">'A'</span>..<span style="color: #00ff00;">'Z'</span>,<span style="color: #00ff00;">'a'</span>..<span style="color: #00ff00;">'z'</span>,<span style="color: #00ff00;">'0'</span>..<span style="color: #00ff00;">'9'</span>,<span style="color: #00ff00;">'_'</span>])
        <span style="color: #00ffff;">ELSE</span>
            <span style="color: #00ffff;">REPEAT</span>
                <span style="color: #00ffff;">IF</span> k &lt;= reslength <span style="color: #00ffff;">THEN</span> res[k] := ch;
                <span style="color: #00ffff;">IF</span> k &lt;= identlength <span style="color: #00ffff;">THEN</span> ident[k] := ch;
                getch; k := k + 1
                <span style="color: #00ffff;">UNTIL</span> <span style="color: #00ffff;">NOT</span> (ch <span style="color: #00ffff;">IN</span> specials_repeat);
        i := 1; j := lastresword;
        <span style="color: #00ffff;">REPEAT</span>
            k := (i + j) <span style="color: #00ffff;">div</span> 2;
            <span style="color: #00ffff;">IF</span> res &lt;= reswords[k].alf <span style="color: #00ffff;">THEN</span> j := k -1;
            <span style="color: #00ffff;">IF</span> res &gt;= reswords[k].alf <span style="color: #00ffff;">THEN</span> i := k + 1;
            <span style="color: #00ffff;">UNTIL</span> i &gt; j;
        <span style="color: #00ffff;">IF</span> i - 1 &gt; j
            <span style="color: #00ffff;">THEN</span> sym := reswords[k].symb
            <span style="color: #00ffff;">ELSE</span> sym := identifier;
        <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">OTHERWISE *)</span>
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(*  </span><span style="color: #66f;">CASE *)</span>
9:
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">getsym *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">check</span>(sy : symbol; ss : symset; er : <span style="color: #00ffff;">message</span>);
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">check *)</span>
<span style="color: #00ffff;">IF</span> sym = sy <span style="color: #00ffff;">THEN</span> getsym <span style="color: #00ffff;">ELSE</span>
    <span style="color: #00ffff;">BEGIN</span> point(<span style="color: #00ff00;">'E'</span>,er); <span style="color: #00ffff;">IF</span> sym <span style="color: #00ffff;">IN</span> ss <span style="color: #00ffff;">THEN</span> getsym <span style="color: #00ffff;">END</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">check *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">test</span>(s1,s2 : symset; er : <span style="color: #00ffff;">message</span>);
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">test *)</span>
<span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span> (sym <span style="color: #00ffff;">IN</span> s1) <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">BEGIN</span>
    point(<span style="color: #00ff00;">'E'</span>,er);
    s1 := s1 + s2;
    <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span> (sym <span style="color: #00ffff;">IN</span> s1) <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">REPEAT</span> getsym <span style="color: #00ffff;">UNTIL</span> sym <span style="color: #00ffff;">IN</span> s1;
        point(<span style="color: #00ff00;">'I'</span>,<span style="color: #00ff00;">'skipped symbols to here       '</span>);
        <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">END</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">test *)</span>

<span style="color: #66f;">(* </span><span style="color: #66f;">- - - - -   MODULE OUTPUT   - - - - - *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">putch</span>(c : <span style="color: #ff00ff;">char</span>);
<span style="color: #00ffff;">BEGIN</span>
<span style="color: #00ffff;">write</span>(output,c);
<span style="color: #00ffff;">IF</span> writelisting &gt; 0 <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">BEGIN</span>
    <span style="color: #00ffff;">IF</span> outlinelength = 0 <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">write</span>(listing,linenumspace,linenumsep);
    <span style="color: #00ffff;">write</span>(listing,c)
    <span style="color: #00ffff;">END</span>;
<span style="color: #00ffff;">IF</span> ord(c) = 13 <span style="color: #66f;">(* </span><span style="color: #66f;">newline character *)</span>
    <span style="color: #00ffff;">THEN</span> outlinelength := 0
    <span style="color: #00ffff;">ELSE</span> outlinelength := outlinelength + 1
<span style="color: #00ffff;">END</span>;

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">writeline</span>;
<span style="color: #00ffff;">BEGIN</span>
writeln(output);
<span style="color: #00ffff;">IF</span> writelisting &gt; 0 <span style="color: #00ffff;">THEN</span> writeln(listing);
outlinelength := 0
<span style="color: #00ffff;">END</span>;

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">writeident</span>(a : identalfa);
<span style="color: #ff00ff;">VAR</span> i,length : <span style="color: #ff00ff;">integer</span>;
<span style="color: #00ffff;">BEGIN</span>
length := identlength;
<span style="color: #00ffff;">WHILE</span> a[length] &lt;= <span style="color: #00ff00;">' '</span> <span style="color: #00ffff;">DO</span> length := length - 1;
<span style="color: #00ffff;">IF</span> outlinelength + length  &gt; maxoutlinelength <span style="color: #00ffff;">THEN</span> writeline;
<span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> length <span style="color: #00ffff;">DO</span> putch(a[i])
<span style="color: #00ffff;">END</span>;

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">writeresword</span>(a : resalfa);
<span style="color: #ff00ff;">VAR</span> i,length : <span style="color: #ff00ff;">integer</span>;
<span style="color: #00ffff;">BEGIN</span>
length := reslength;
<span style="color: #00ffff;">WHILE</span> a[length] &lt;= <span style="color: #00ff00;">' '</span> <span style="color: #00ffff;">DO</span> length := length - 1;
<span style="color: #00ffff;">IF</span> outlinelength + length &gt; maxoutlinelength <span style="color: #00ffff;">THEN</span> writeline;
<span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> length <span style="color: #00ffff;">DO</span> putch(a[i])
<span style="color: #00ffff;">END</span>;

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">writeinteger</span>(i : <span style="color: #ff00ff;">integer</span>);

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">writenatural</span>(n : <span style="color: #ff00ff;">integer</span>);
    <span style="color: #00ffff;">BEGIN</span>
    <span style="color: #00ffff;">IF</span> n &gt;= 10 <span style="color: #00ffff;">THEN</span> writenatural(n <span style="color: #00ffff;">DIV</span> 10);
    putch(chr(ord(<span style="color: #00ff00;">'0'</span>) + n <span style="color: #00ffff;">MOD</span> 10))
    <span style="color: #00ffff;">END</span>;

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">writeinteger *)</span>
<span style="color: #00ffff;">IF</span> outlinelength + 12 &gt; maxoutlinelength <span style="color: #00ffff;">THEN</span> writeline;
<span style="color: #00ffff;">IF</span> i &gt;= 0 <span style="color: #00ffff;">THEN</span> writenatural(i) <span style="color: #00ffff;">ELSE</span>
    <span style="color: #00ffff;">BEGIN</span> putch(<span style="color: #00ff00;">'-'</span>); writenatural(-i) <span style="color: #00ffff;">END</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">writeinteger *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">finalise</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">fin</span>(<span style="color: #ff00ff;">VAR</span> f : text);
    <span style="color: #00ffff;">BEGIN</span>
    <span style="color: #00ffff;">IF</span> errorcount &gt; 0 <span style="color: #00ffff;">THEN</span> writeln(f,errorcount:0,<span style="color: #00ff00;">' error(s)'</span>);
    writeln(f,clock - start_clock:0,
        <span style="color: #00ff00;">' milliseconds CPU'</span>)
    <span style="color: #00ffff;">END</span>;

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">finalise *)</span>
fin(output);
<span style="color: #00ffff;">IF</span> writelisting &gt; 0 <span style="color: #00ffff;">THEN</span> fin(listing)
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">finalise *)</span>
</pre>
</div>
</div>
</div>
