17-utilities.html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Remarks and a major project</h2>
<div class="outline-text-2" id="text-5">
<p>
The utilities implemented here are being used by three quite disparate programs in the next three chapters.  None of the programs use all the facilities, but that is unavoidable for something as general as this.  One exercise that might be worthwhile is to make the <code>IF</code> directive more powerful by letting it operate not just on the remainder of the line but on all following lines up to an <code>ENDIF</code> directive.  Clearly an <code>ELSE</code> directive would be useful, too.  The language C has a preprocessor called cpp which does this sort of thing.  Again, being able to define constants would be useful; the preprocessor cpp for the language C has this.  Some of the reading given for Chapter 4 on macro expansion is relevant.
</p>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <i>A Major Project</i>:</h2>
<div class="outline-text-2" id="text-6">
<p>
This project is not immediately tied to the utilities in this chapter, but it can use them profitably, and it has much less to do with the programs in the later chapters.
</p>

<p>
Design a small procedural language.  It should include declarations of global variables, of procedures and functions which can have value parameters and local variables.  Unlike Pascal, procedure and functions cannot be nested.  Variables and parameters are to be typed, and so are the values returned by functions.  But there will be only three inbuilt types: boolean, char and integer, and no type constructors.  The statements should include assignment, call, <code>IF-THEN(-ELSE)</code> and <code>WHILE-DO</code>.  The expressions should include a reasonable collection of operations on the inbuilt types.
</p>

<p>
You should begin by writing a context free grammar first.  Then write a context free parser which reports errors.  Add error recovery in accordance with Wirth (1976 pp 320 - 322) or Terry (1986 pp 208 - 211).  You should now be able to have a test program that has many context free errors.
</p>

<p>
Next, add a symbol table for entering global variables, procedures and functions and their parameters and local variables.  Note that at the end of a procedure or function declaration the names of the parameters and locals have to become invisible, but the types of the parameters still have to accessible.  Take some care to avoid spurious error messages.  It helps to have an additional type <code>notype</code> in expressions.  Write a test program that has many context sensitive errors.
</p>

<p>
You can now add code generation to this compiler.  There are many possibilities: to translate into some existing language, to translate into some internal language that will be interpreted either recursively or non-recursively, or to translate into some intermediate language first which can then be translated independently into several other languages.
</p>
</div>
</div>
</div>
</body>
</html>
